app/views/houses/show.html.erb

<p class="houseAmenities">Amenities: <%=@house.amenities%></p>
<% if @house.reviews.count !=0 %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."house_id" = ?  [["house_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."house_id" = ?  [["house_id", 1]]